app/Livewire/Backend/Subscribers/SubscriberComponent.php

select * from `subscribers` where `email` like '%%' limit 1 offset 1
select count(*) as aggregate from `subscribers` where `email` like '%%'
---
    public function render()
    {
        return view('backend.subscribers.subscriber-component', [
            'subscribers' => \App\Models\Subscriber::where('email', 'like', '%' . $this->searchTerm . '%')->paginate(1),
        ]);