app/Livewire/Backend/Skills/BackendSkillsShowData.php

    public function render()
    {
        return view('backend.skills.backend-skills-show-data', ['skills' => Skill::paginate(10)]);
---
select * from `skills` limit 10 offset 0
select count(*) as aggregate from `skills`