app/Livewire/Backend/Skills/BackendSkillsShowData.php

select * from `skills` where `name` like '%Sk%' limit 10 offset 0
select count(*) as aggregate from `skills` where `name` like '%Sk%'
---
    public function render()
    {
        return view('backend.skills.backend-skills-show-data', ['skills' => Skill::where("name", "like", "%{$this->searchTerm}%")->paginate(10)]);