app/Livewire/Backend/Skills/CreateSkillsData.php

    public function saveSkill()
    {
        //validation
        $data = $this->validate();
        //save skill
        Skill::create($data);
---
insert into `skills` (`name`, `prograss`, `updated_at`, `created_at`) values ('Dexter Tanner', '98', '2025-12-29 07:54:22', '2025-12-29 07:54:22')