app/Livewire/Backend/Skills/DeleteSkill.php

    public function skillDelete($id)
    {
        $this->skill_id = Skill::find($id);
---
select * from `skills` where `skills`.`id` = 1 limit 1

    public function deleteSkill()
    {

        if (!$this->skill_id) {
            return;
        }

        $this->skill_id->delete();
---
delete from `skills` where `id` = 6