app/Livewire/Backend/Skills/ShowDataCompomnt.php

    public function skillShow($id)
    {
        $this->skill = Skill::find($id);
---
select * from `skills` where `skills`.`id` = 2 limit 1