app/Livewire/Backend/Skills/UpdateSkillData.php

    public function skillUpdate($id)
    {
        $this->skill = Skill::find($id);
---
select * from `skills` where `skills`.`id` = 1 limit 1

    public function updateSkill()
    {
        //validation
        $data = $this->validate();
        // save skill
        $this->skill->update($data);
---
update `skills` set `prograss` = '100', `skills`.`updated_at` = '2025-12-29 07:54:12' where `id` = 8