app/Livewire/Backend/Settings/UpdateSettingComponet.php

    public function mount()
    {
        $this->setting = Setting::find(1);
---
select * from `settings` where `settings`.`id` = 1 limit 1